DockablePaneInterop.PreTranslateMessage(tagMSG*)
Override message pre-translation to allow the WPF source and any embedded
WinForms controls to handle any keyboard input properly, prior to Windows
doing any sort of translation or dispatching.
Remarks:
This pre-translation is required for proper handling of tabbing and other
keyboard mnemonics for the embedded WPF/WinForms controls.

DockablePaneInterop.attachPane(HWND__*,Autodesk.Revit.UI.DockablePaneProviderData)
Called to attach to the specified pane
parent: The native HWND parent/container for the Pane.
paneData: The provider information describing the Pane.
Returns:
true if successfully attached, false otherwise.